Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_to_ireland/visas_for_business_people_visiting_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Visas for people visiting Ireland on business
ga: Víosaí do dhaoine ag teacht go hÉirinn le haghaidh gnó

source: Travelling to Ireland on business
ga: Taisteal go hÉirinn ar gnó

source: Citizens of certain countries must apply for a visa to enter Ireland before they travel here on business trips
ga: Caithfidh saoránaigh thíortha áirithe iarratas a dhéanamh ar víosa chun Éire a iontráil sula dtaistealaíonn siad anseo ar turais ghnó

source: Information on those who need an entry visa is available in our document: Visa requirements for entering Ireland
ga: Tá fáil ar fhaisnéis fúthu siúd a dteastaíonn víosa iontrála uathu inár gcáipéis: Riachtanais víosa chun Éire a iontráil

source: Citizens of EU/EEA member states or Switzerland do not require a visa to travel to Ireland on business
ga: Ní theastaíonn víosa ó shaoránaigh bhallstáit an AE/an LEE nó na hEilvéise chun taisteal go hÉirinn chun gnó a dhéanamh

source: (The members of the EEA are the 28 countries of the European Union (EU), together with Iceland, Norway and Liechtenstein)
ga: (Is iad baill an LEE na 28 tír den Aontas Eorpach (an AE), anuas ar an Íoslainn, an Iorua agus Lichtinstéin)

source: There is information for non-EEA nationals applying for a short-stay visa to accompany or join an EU citizen family member in Ireland on the Irish Naturalisation & Immigration Service (INIS) website
ga: Tá faisnéis ar fáil do náisiúnaigh neamh-LEE a dhéanann iarratas ar víosa gearrchuairte chun duine muinteartha le saoránach an AE a thionlacan nó bheith ina gcuideachta in Éirinn ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SDIÉ)

source: Even if you do not require a visa to enter Ireland, all non-EEA nationals must obtain permission to enter the State by reporting to an Immigration Officer at the port of entry
ga: Fiú mura dteastaíonn víosa uait chun Éire a iontráil, caithfidh gach náisiúnach neamh-LEE cead a fháil chun an Stát a iontráil trí chasadh le hOifigeach Inimirce ag an bport iontrála

source: You should have supporting documentation relating to the purpose of your visit (see below)
ga: Ba cheart go mbeadh cáipéisíocht tacaíochta agat a bhaineann le cuspóir do chuairte (féach thíos)

source: The Short Stay Visa Waiver Programme allows nationals of a number of Eastern European, Middle East and Asian countries who have a short-term UK visa to come to Ireland without the need for a separate Irish visa
ga: Ó Iúil 2011 i leith, ceadaíonn an Clár Tarscaoilte Víosa Gearrchuairte do náisiúnaigh thíortha, ar nós na hIndia, na Síne agus Chónaidhm na Rúise, a bhfuil víosa gearrthéarmach an RA acu chun teacht go hÉirinn gan víosa Éireannach ar leith a bheith ag teastáil uathu

source: This programme has been extended to 31 October 2021
ga: Cuirfear deireadh leis an gClár an 31 Deireadh Fómhair 2016

source: The British Irish Visa Scheme applies to visitors from China since 20 October 2014 and to visitors from India since 9 February 2015
ga: Ón 13 Deireadh Fómhair 2014, faoi Scéim nua Víosa na Breataine-na hÉireann (BIVS), féadfaidh cuairteoirí ón tSín taisteal gan srian laistigh den Chomhlimistéar Taistil, (is é sin, Éire agus an RA, lena n-áirítear Tuaisceart Éireann), agus víosa gearrchuairte na hÉireann nó an RA atá formhuinithe le ‘BIVS’ a úsáid

source: This scheme allows visitors from these countries to travel freely within the Common Travel Area (in this case, Ireland and the UK but not the Channel Islands and the Isle of Man), using either an Irish or UK visa
ga: Oibrítear an Scéim trí shocrú cómhalartach víosa, ina n-aithníonn Éire agus an RA víosaí gearrchuairte a d’eisigh an tír eile go ndéanfaidh daoine taisteal chuig a ndlínse

source: If you are coming to Ireland for a business meeting and you require a visa, you must present the following with your visa application
ga: Má tá tú ag teacht go hÉirinn le haghaidh cruinniú gnó agus má theastaíonn víosa uait, ní mór duit an méid a leanas a sholáthar le d’iarratas ar víosa

source: • A letter of invitation from the Irish company in question, outlining what you will be doing on your proposed stay in Ireland and how long you will be staying
ga: • Litir chuiridh ón gcuideachta Éireannach atá i gceist, ina dtugtar cuntas ar cad a bheidh á dhéanamh agat le linn d’fhanachta bheartaithe in Éirinn agus cé chomh fada a bheidh tú ag fanacht

source: • Confirmation of where you will be staying during your proposed stay in Ireland
ga: • Deimhniú i leith na háite ina mbeidh tú ag fanacht i rith d’fhanachta bheartaithe in Éirinn

source: • Confirmation of who will be responsible for your expenses during your stay in Ireland. (Irrespective of whether it is you or your company, evidence may be required)
ga: • Deimhniú i leith an té a bheidh freagrach as do chostais i rith d’fhanachta in Éirinn (Gan aird ar cé acu an tú féin nó do chuideachta a bheidh i gceist, b’fhéidir go dteastóidh fianaise)

source: There is more information on the documentation required for a business visa on the website of the Irish Naturalisation and Immigration Service of the Department of Justice and Equality
ga: Tá breis faisnéise ar an gcáipéisíocht a theastaíonn le haghaidh víosa gnó ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann de chuid na Roinne Dlí agus Cirt agus Comhionannais

source: If you are coming to Ireland for a conference and you require a visa, you must present the following with your visa application:
ga: Má tá tú ag teacht go hÉirinn le haghaidh comhdhála agus má theastaíonn víosa uait, ní mór duit an méid a leanas a sholáthar le d’iarratas ar víosa:

source: • A letter from the conference host outlining the nature and duration of your proposed stay in Ireland
ga: • Litir ó óstach na comhdhála ina dtugtar cuntas ar chineál agus ar fhad d’fhanachta bheartaithe in Éirinn

source: • Confirmation of who will be responsible for your expenses during your stay in Ireland. If it is you or your company, evidence may be required
ga: • Deimhniú i leith an duine a bheidh freagrach as do chuid costas i rith d’fhanachta in Éirinn Más tú féin nó do chuideachta a bheidh i gceist, b’fhéidir go dteastóidh fianaise

source: The Irish Naturalisation and Immigration Service has more information on the documentation required for a conference visa
ga: Tá níos mó faisnéise ag Seirbhís Eadóirseachta agus Inimirce na hÉireann ar an gcáipéisíocht a theastaíonn le haghaidh víosa comhdhála

source: All non-EEA nationals, including those with visas, must obtain permission to enter the State by reporting to an Immigration Officer at the port of entry
ga: Caithfidh gach náisiúnach neamh-LEE, iad siúd a bhfuil víosaí acu ina measc, cead a fháil chun an Stát a iontráil trí chasadh le hOifigeach Inimirce ag an bport iontrála

source: You should have supporting documentation relating to the purpose of your visit on your person when coming through immigration
ga: Ba cheart go mbeadh cáipéisíocht tacaíochta agat a bhaineann le cuspóir do chuairte nuair a iontrálann tú Éire trí inimirce

source: You can read more in our document on permission to land in Ireland
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar chead chun tuirlingt in Éirinn

source: What do I do if I want to leave for a short while?
ga: Cad a dhéanaim más mian liom fágáil ar feadh tamall gearr?

source: The visa issued to you allows you to enter the State once
ga: Ceadaíonn an víosa a eisíodh duit chun an Stát a iontráil uair amháin

source: If you wish to leave for a short while and then return you must apply for a re-entry visa
ga: Más mian leat fágáil ar feadh tamall gearr agus filleadh ina dhiaidh sin, ní mór duit iarratas a dhéanamh ar víosa athiontrála

source: (See 'How to apply' below for information on how to apply for a re-entry visa.)
ga: (Féach ‘Conas iarratas a dhéanamh’ thíos chun teacht ar fhaisnéis ar conas iarratas a dhéanamh ar víosa athiontrála.)

source: It is your responsibility to ensure you have the correct visa (if required) for the country you intend travelling to
ga: Tá an fhreagracht ort a chinntiú go bhfuil an víosa ceart agat (má theastaíonn sé) don tír a mbeartaíonn tú taisteal chuici

source: Please note that you must obtain a visa from the UK authorities before travelling to Northern Ireland (Counties Antrim, Armagh, Derry, Down, Fermanagh and Tyrone)
ga: Tabhair faoi deara, ní mór duit víosa a fháil ó údaráis an RA sula dtaistealaíonn tú chuig Tuaisceart Éireann (Contae Aontroma, Ard Mhacha, Dhoire, an Dúin, Fhear Manach agus Thír Eoghain)

source: Information on applying for a visa to visit the UK is available from UK Visas and Immigration
ga: Tá fáil ar fhaisnéis ar iarratas a dhéanamh ar víosa chun cuairt a thabhairt ar an RA ó Víosaí agus Inimirce an RA

source: Information on those who need a visa to visit Ireland is available in our document: Visa requirements for entering Ireland
ga: Eolas ar iad siúd a bhfuil gá le víosa atá ar fáil sa doiciméad: Riachtanais víosa le teacht isteach in Éirinn

source: You do not require a visa if you are from an EU/EEA member state
ga: Ní gá duit víosa a fháil le cuairt a thabhairt ar Éirinn más más saoránach de chuid an AE/LEE tú

source: Standard non-refundable visa application processing fees are:
ga: Is iad na gnáth-tháillí neamhaisíoctha le hiarratas ar víosa a phróiseáil ná:

source: Certain applicants are not required to pay a fee
ga: Ní gá d’iarratasóirí áirithe aon táille a íoc

source: They include visa-required spouses and certain family members of EU/EEA citizens
ga: Áirítear leo siúd céilí ar gá dóibh víosaí a bheith acu agus baill theaghlaigh saoránach de chuid an AE/LEE

source: In addition, applicants from some countries are not required to pay a fee
ga: Lena chois sin ní gá d’iarratasóirí ó thíortha áirithe aon táille a íoc

source: As this changes from time to time, you should check with your local Irish embassy or consulate, or with the Visa Office - see 'Where to apply'
ga: Ós rud é go n-athraíonn sé seo ó am go chéile, ba chóir duit ceist a chur ar ambasáid nó ar chonsalacht na hÉireann atá gar duit nó ar an Oifig Víosa - féach ‘Cá háit a dhéanfaidh mé iarratas’

source: Nationals of the countries covered by the Short-stay Visa Waiver Programme who are long-term legal residents of the UK or the Schengen area will still require a visa but will not have to pay the visa fee
ga: Ní gá do náisiúnaigh de na tíortha faoi chumhdach an Chláir Tarscaoilte Víosa Gearrchónaithe, atá ina gcónaí go dlíthiúil sa RA nó sa limistéar Schengen an táille víosa a íoc ach is gá díobh víosa a bheith acu fós

source: You must apply for a visa online
ga: Caithfidh tú iarratas ar víosa a dhéanamh ar líne

source: There is information on how to complete an online application in English (pdf) as well as in Arabic (pdf), Chinese (pdf), Russian (pdf), French (pdf), Turkish (pdf), Hindi (pdf) and Urdu (pdf)
ga: Tá faisnéis faoi conas iarratas a dhéanamh ar líne as Béarla (pdf) agus as Araibis (pdf), as Sínis (pdf), as Rúisis (pdf), as Fraincis (pdf), as Tuircis (pdf), as Hiondúis (pdf) agus as Urdais (pdf)

source: Details of what documents you will need and the photographic requirements are on the Irish Naturalisation and Immigration Service (INIS) website
ga: Tá sonraí faoi na cáipéisí a bheidh ag teastáil uait agus na riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: The Irish Government has started collecting biometric data from certain visa applicants
ga: Tosaíonn Rialtas na hÉireann sonraí bithmhéadracha ó iarratasóirí víosa áirithe a bhailiú

source: From March 2010 all visa applicants aged 6 years and over residing in Nigeria must provide fingerprints
ga: Ó Márta 2010 ní mór do gach iarratasóir víosa atá os cionn aois 6 agus ina chónaí sa Nigéir, méarloirg a sholáthar

source: You can find information about biometric data on the INIS website
ga: Tá tuilleadh eolais faoi shonraí bithmhéadracha ar fáil ar an suíomh gréasáin SEIÉ

source: The Irish Naturalisation and Immigration Service recommends that you should allow at least 8 weeks for your visa application to be processed
ga: Molann Seirbhís Eadóirseachta agus Inimirce na hÉireann go dtabharfá 8 seachtaine ar a laghad chun d’iarratas ar víosa a phróiseáil

source: Detailed information on the application procedures is available on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: Tá faisnéis mhionsonraithe ar na nósanna imeachta iarratais ar fáil ar láithreán gréasáin na Seirbhíse Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: Applying for a re-entry visas
ga: Cur isteach ar víosaí athiontrála

source: Before applying for a re-entry visa you must register with the local immigration officer for the district in which you are staying (Burgh Quay Registration Office if staying in Dublin)
ga: Sula gcuireann tú isteach ar víosa athiontrála ní mór duit clárú le hoifigeach inimirce an cheantair sin ina bhfuil tú i do chónaí. (Is é sin Oifig Chlárúcháin Cé an Bhúrcaigh má tá cónaí ort i mBaile Átha Cliath)

source: You can read more about registration in our document on Registration of non-EEA nationals in Ireland
ga: Féadfaidh tú tuilleadh a léamh faoi chlárú inár ndoiciméad faoi Clárú náisiúnach nach den LEE iad in Éirinn

source: Sent your completed Re-Entry Visa Application Form, along with all required documentation, by registered post to the:
ga: Seol an Foirm Iarratais le haghaidh Víosa Athiontrála comhlánaithe mar aon leis an gcáipéisíocht riachtanach go léir trí phost cláraithe chuig:

source: Re-entry Visa Processing Office,
ga: Oifig Próiseála Víosaí Athiontrála,

source: Irish Naturalisation and Immigration Service,
ga: Seirbhís Eadóirseachta agus Inimirce na hÉireann,

source: Apply for your re-entry visa well in advance of your proposed dates of travel
ga: Cuir isteach ar do víosa athiontrála i bhfad roimh na dátaí a bhfuil sé ar intinn agat taisteal

source: Postal applications for re-entry visas will be processed within 4 days of receipt and your re-entry visa will be returned to you by registered post
ga: Déanfar iarratais ar víosaí athiontrála a fhaightear tríd an bpost a phróiseáil laistigh de 4 lá ón am a fhaightear iad, agus cuirfear do víosa athiontrála ar ais chugat trí phost cláraithe

source: If you wish to apply in person at the Visa Office you must book an appointment online
ga: Más mian leat iarratas a dhéanamh go pearsanta chuig Oifig Víosaí, ní mór duit coinne a chur in áirithe ar líne

source: You will need to have a completed application form and all required documentation with you
ga: Beidh ort foirm iarratais chomhlánaithe agus an cháipéisíocht riachtanach go léir a bheith agat

source: There is more information on applying for a re-entry visa, as well as information on photographic requirements on the Irish Naturalisation and Immigration Service website
ga: Tá tuilleadh eolais faoi cur isteach ar víosa athiontrála agus faisnéis faoi riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann

source: If you require a visa in order to enter Ireland, your application must be made online
ga: Cá háit a ndéanfaidh mé iarratais

source: Your nearest Irish embassy or consulate
ga: Caithfidh tú iarratas ar víosa a dhéanamh ar líne
